<script setup></script>

<template>
  <div class="normal">
    <h2>會員優惠與資格</h2>
    <span>禮金贈送後60天內皆有效，並以贈送當下時間點開始計算</span>
    <h4>歡迎入會！成為魔呼株式会社社員享好禮</h4>
    <p>
      只要在官網註冊會員，即可成為會員〈社員〉。<br />
      新社員可獲得「50元貓貓入社禮金」。
    </p>
    <h4>首次購物享有回饋金</h4>
    <p>
      為感謝首次購物的社員，<br />
      將於首次購物後贈送「50元魔呼首購回饋金」。
    </p>

    <h4>魔呼滿額贈送金</h4>
    <p>
      凡單筆消費滿5,000元〈含以上，可累贈〉，<br />
      即送「 100元魔呼滿額贈送金」。
    </p>

    <h4>會員生日</h4>
    <p>
      已成為魔呼株式会社社員者，將以社員入社填寫的生日月份，<br />
      於當月1號寄送「50元生日購物金」。
    </p>
    <br /><br />
    <h2>會員權益</h2>
  </div>

  <!--  log  -->
  <div class="log">
    <p>
      親愛的會員您好，非常感謝您使用本商店的服務（以下稱本服務），本商店將根據以下之會員服務條款(以下簡稱本條款)，提供會員便利的交易。為了保障您的權益，請務必詳讀本條款，在您註冊成為本商店會員、或開始使用本服務時，即視為您已經閱讀、瞭解並同意接受本條款及「隱私權保護政策」之所有內容，並視為您已確認詳閱並同意個人資料保護告知暨同意事項。
      如您不同意本條款之全部或部分內容，請勿註冊，並請立即停止使用本服務。本條款之具體約定內容如後：<br /><br />
      <span>一、會員資料<br /></span>
      01._在您使用本服務之前，必須提供正確個人資料，並加入成為本商店會員，無須支付任何費用；在加入完成後，使用本服務及參加與本服務相關之活動。如個人資料有異動，請務必即時更新，以保障您的權益。如因會員未正確更新個人資料，致未能收到本公司寄發之會員權益、消費優惠、活動內容等相關資訊，或變更、終止會員權益、消費優惠、活動內容之通知，會員同意在此情形下，視為會員已經收到該等資訊或通知。<br />
      02._隱私權保護聲明：會員之個人資料受到本商店隱私權條款之保護與規範。<br /><br />
      <span>二、服務內容的變更<br /></span>
      會員同意本商店得隨時調整、變更、修改或終止本服務及本條款，於本商店公告後生效，不再另行個別通知。<br />
      會員因參與本商店活動及使用本商店服務，而與本商店所發生之權利義務關係，均以本條款最新修訂之版本為準。<br /><br />
      <span>三、商店個人資料保護告知及暨同意事項：<br /></span>
      為提供會員最完善的服務，並保護會員個人資料，本商店謹此依個人資料保護法(下稱個資法)規定，告知您如下事項：<br /><br />
      (一)蒐集之目的、個人資料類別、利用期間、地區、對象及方式<br />
      為提供會員有關本商店各項消費優惠、商品、服務、活動及最新資訊，並有效管理會員資料、進行服務與調查、滿意度及消費統計分析調查(下稱蒐集目的)，本商店將於上開蒐集目的消失前，在完成上開蒐集目的之必要地區內，蒐集、處理、利用您填載於本商店會員申請之個人資料、消費與交易資料，或日後經您同意而提供之其他個人資料。在上開蒐集目的範圍內，本商店可能會將您全部或部分個人資料，提供予合作廠商。<br /><br />
      例：當會員使用本服務進行線上消費，本公司需透過宅配貨運等合作廠商，方能完成貨品或相關贈品之配送，故當會員完成線上交易，即表示會員同意並授權本公司得將會員提供之個人資料(如收件人姓名、配送地址、電話…等)提供予宅配及貨運合作廠商，以利完成貨品或相關贈品之配送。<br /><br />
      (二)注意事項：<br />
      您同意以電子文件作為行使個資法書面同意之方式。如您不同意提供個人資料，或要求刪除或停止蒐集、處理您的個人資料，您瞭解本商店可能因此無法進行網路會員資格審核及相關處理作業，或提供您完善的網路服務，尚請見諒。<br />
    </p>
  </div>

  <!--   hint   -->
  <div class="hint">
    <n-divider></n-divider>
    <p>
      ※提醒您：<br />
      訂單成立後全不退貨
    </p>
    若訂單金額使用折價優惠，則無法再次使用折價券，並於退款金額扣除訂單折價優惠。<br />
    <br />
    <p>訂單取消退貨</p>
    原訂單折價優惠(含生日優惠、行銷優惠等)恕不返還再次使用。<br />
    <br />
    <p>訂單成立後有合購組合商品/滿額加價購/多件優惠價時</p>
    您必須將活動商品全數退貨，恕無法接受單一品項退貨。<br />
  </div>
</template>

<style lang="less" scoped>
.normal {
  text-align: left;
  margin-top: 0.36rem;
  padding: 0 0.36rem;
  h2 {
    color: #958264;
    font-size: 0.6rem;
    font-weight: 900;
  }
  h4 {
    color: #865937;
    font-size: 0.4rem;
    font-weight: 900;
    margin: 0.4rem 0 0.1rem 0;
  }
  p {
    color: #7a5e49;
    font-size: 0.2rem;
    font-weight: 500;
  }
  span {
    font-size: 0.2rem;
    background-color: #d7ccae;
    color: #958264;
    padding: 0.07rem 0.15rem;
  }
}

.hint {
  text-align: left;
  padding: 0 0.36rem;
  color: #7a5e49;
  font-size: 0.2rem;
  font-weight: 500;
  p {
    color: #5e3e1f;
    font-weight: 700;
  }
  .n-divider {
    margin: 1.4rem 0 1.4rem 0;
  }
}

.log {
  text-align: justify;
  margin: 0.15rem 0.36rem 0 0.36rem;
  padding: 0.35rem;
  height: 5rem;
  overflow-y: scroll;
  background-color: #d7ccae;
  p {
    color: #7a5e49;
    font-size: 0.2rem;
    font-weight: 500;
    span {
      color: #865937;
      font-size: 0.35rem;
      font-weight: 700;
    }
  }
}
</style>
